feat: mermaid diagrams instead of ascii plots
